app/views/announcements/_form.html.erb

SELECT "games".* FROM "games" WHERE (is_active = 't')
---
    <%= f.label :game_id %><br />
	<%= f.collection_select(:game_id, Game.where("is_active = ?", true), :id, :name, options ={:prompt => "Select a game"}, :class =>"game") %>