app/views/profiles/newgame.html.erb

SELECT "games".* FROM "games" WHERE (is_active = 't')
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1
---
    Game: <br />
	<%= collection_select(:profile, :game_id, Game.where("is_active = ?", true), :id, :name, options ={:prompt => "Select a game"}, :class =>"game") %>