app/views/profiles/newgame.html.erb

SELECT "games".* FROM "games"
---
    Game: <br />
	<%= collection_select(:type_helper, :id, Game.all, :id, :name, options ={:prompt => "Select a game"}, :class =>"game") %>