app/views/users/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1
---
  <ul>
    <% @user.game_profiles.each do |gprof| %>