app/views/characters/new.html.erb

    Game: <br />
	<%= collection_select(:character, :game_id, Game.where("is_active = ?", true), :id, :name, options ={:prompt => "Select a game"}, :class =>"game") %>
---
SELECT "characters".* FROM "characters" WHERE ("characters".game_profile_id = 14)