app/views/roles/_form.html.erb

SELECT "users".* FROM "users"
SELECT "users".id FROM "users" INNER JOIN "roles_users" ON "users".id = "roles_users".user_id WHERE ("roles_users".role_id = 1 )
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1 )
---
    <%= f.label "Users" %><br />
    <% for user in User.all %>
      <%= check_box_tag 'role[user_ids][]', user.id, @role.user_ids.include?(user.id), :id => dom_id(user) %>