app/controllers/characters_controller.rb

  def edit
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE ("characters"."id" = 2) LIMIT 1

  def create
    @game = Game.find(params[:game_id])
    @character = @game.characters.factory(@game.type, @game.id, params[:character])

    respond_to do |format|
      if @character.save
        @profile = Profile.find(@character.game_profile_id)
---
SELECT "games".* FROM "games" WHERE ("games"."id" = 4) LIMIT 1
INSERT INTO "characters" ("game_id", "name", "created_at", "updated_at", "type", "faction", "race", "klass", "server", "extra", "rank", "game_profile_id") VALUES (1, 'Star Wars Character', '2010-12-25 06:34:55.288015', '2010-12-25 06:34:55.288015', 'SwtorCharacter', '', '', '', NULL, NULL, NULL, NULL)
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 21) LIMIT 1

  def update
    @game = Game.find(params[:game_id])
    @character = Character.find(params[:id])

    respond_to do |format|
      if @character.update_attributes(params[:character])
---
SELECT "games".* FROM "games" WHERE ("games"."id" = 5) LIMIT 1
SELECT "characters".* FROM "characters" WHERE ("characters"."id" = 2) LIMIT 1
UPDATE "characters" SET "rank" = 1, "updated_at" = '2010-12-25 05:07:02.190423' WHERE ("characters"."type" = 'SwtorCharacter') AND ("characters"."id" = 3)

  def destroy
    @game = Game.find(params[:game_id])
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT "games".* FROM "games" WHERE ("games"."id" = 4) LIMIT 1
SELECT "characters".* FROM "characters" WHERE ("characters"."id" = 3) LIMIT 1
DELETE FROM "characters" WHERE ("characters"."type" = 'WowCharacter') AND ("characters"."id" = 2)