app/controllers/game_announcements_controller.rb

  def index
    @game_announcements = GameAnnouncement.all
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'GameAnnouncement')

  def show
    @game_announcement = GameAnnouncement.find(params[:id])
    if @game_announcement.game_id != nil
      @game = Game.find(@game_announcement.game_id)
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'GameAnnouncement') AND ("announcements"."id" = 1) LIMIT 1
SELECT "games".* FROM "games" WHERE ("games"."id" = 1) LIMIT 1

  def edit
    @game_announcement = GameAnnouncement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'GameAnnouncement') AND ("announcements"."id" = 1) LIMIT 1

  def create
    @game_announcement = GameAnnouncement.new(params[:game_announcement])

    respond_to do |format|
      if @game_announcement.save
---
INSERT INTO "announcements" ("title", "body", "game_id", "created_at", "updated_at", "type") VALUES ('Test Game Announcement', 'This is a test of the game announcement system. This is only a test.', 1, '2011-01-01 01:38:11.889059', '2011-01-01 01:38:11.889059', 'GameAnnouncement')