app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    if !current_user.can_show("Game")
      render :nothing => true, :status => :forbidden
    else
      @games = Game.all

SELECT "games".* FROM "games" WHERE ("games"."id" = 1) LIMIT 1
---
  def show
    if !current_user.can_show("Game")
      render :nothing => true, :status => :forbidden
    else
      @game = Game.find(params[:id])