app/controllers/permissions_controller.rb

  def load_and_authorize_permissions_from_role
    @role = Role.find_by_id(params[:role_id])
---
SELECT "roles".* FROM "roles" WHERE ("roles"."id" = 1) LIMIT 1