app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions"
---
  def index
    @permissions = Permission.all

SELECT "permissions".* FROM "permissions" WHERE ("permissions"."id" = 1) LIMIT 1
---
  def show
    @permission = Permission.find(params[:id])

SELECT "permissions".* FROM "permissions" WHERE ("permissions"."id" = 1) LIMIT 1
---
  def edit
    @permission = Permission.find(params[:id])

SELECT "permissions".* FROM "permissions" WHERE ("permissions"."id" = 1) LIMIT 1
UPDATE "permissions" SET "create_p" = 'f', "show_p" = 'f', "update_p" = 'f', "delete_p" = 'f', "updated_at" = '2011-01-01 01:06:49.802517' WHERE ("permissions"."id" = 7)
---
  def update
    @permission = Permission.find(params[:id])

    respond_to do |format|
      if @permission.update_attributes(params[:permission])