app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1

  def show
    @profile = Profile.find(params[:id])
    if @profile.game_id != nil
      @game = Game.find(@profile.game_id)
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1
SELECT "games".* FROM "games" WHERE ("games"."id" = 1) LIMIT 1

  def edit
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1

  def create
    if @profile == nil
      logger.debug "profile was nil"
      @profile = UserProfile.new(params[:profile])
      @profile.user = current_user
    else
      @profile.update_attributes(params[:profile])
    end

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "created_at", "updated_at", "type", "user_id", "game_id") VALUES ('My star wars profile', '2010-12-26 18:32:57.461989', '2010-12-26 18:32:57.461989', NULL, 1, NULL)

  def update
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1

  def destroy
    @profile = Profile.find(params[:id])
    if @profile.destroy
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1
DELETE FROM "profiles" WHERE ("profiles"."type" = 'GameProfile') AND ("profiles"."id" = 2)