app/controllers/roles_controller.rb

  def index
    if !current_user.can_show("Role")
      render :nothing => true, :status => :forbidden
    else
      @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def new
    if !current_user.can_create("Role")
      render :nothing => true, :status => :forbidden
    else
      @role = Role.new
      @permissions = Array.new()
      for resource in SystemResource.all
        @permissions << Permission.new(:permissionable => resource, :name => resource.name, :show_p => false, :create_p => false, :update_p => false, :delete_p => false)
      end
      @users = User.all
---
SELECT "system_resources".* FROM "system_resources"
SELECT "users".* FROM "users"

  def edit
    if !current_user.can_update("Role")
      render :nothing => true, :status => :forbidden
    else
      @role = Role.find(params[:id])
      @permissions = @role.permissions
      @users = User.all
---
SELECT "users".* FROM "users"