app/controllers/roles_controller.rb

  def create
    #@role = Role.new(params[:role])
    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ('User Admin', '2011-01-01 01:04:20.046179', '2011-01-01 01:04:20.046179')

  def destroy
    #@role = Role.find(params[:id])
    if @role.destroy
---
DELETE FROM "roles" WHERE ("roles"."id" = 2)

  def load_role
    @roles = current_community.roles
    @role = current_community.roles.find_by_id(params[:id])
---
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1 )