app/controllers/site_announcements_controller.rb

  def index
    @site_announcements = SiteAnnouncement.all
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'SiteAnnouncement')

  def show
    @site_announcement = SiteAnnouncement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'SiteAnnouncement') AND ("announcements"."id" = 2) LIMIT 1

  def edit
    @site_announcement = SiteAnnouncement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE ("announcements"."type" = 'SiteAnnouncement') AND ("announcements"."id" = 2) LIMIT 1

  def create
    @site_announcement = SiteAnnouncement.new(params[:site_announcement])
    if !current_user.can_create(@site_announcement)
      render_insufficient_privileges
    else
      if @site_announcement.save
---
INSERT INTO "announcements" ("title", "body", "game_id", "created_at", "updated_at", "type") VALUES ('Test Site Announcement', 'This is a test.', NULL, '2011-01-01 01:40:23.285853', '2011-01-01 01:40:23.285853', 'SiteAnnouncement')