app/controllers/users_controller.rb

INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES ('joew@timjoe.com', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '2010-12-25 04:19:24.076040', '2010-12-25 04:19:24.076040')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save