app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if !current_user.can_show("User")
      render :nothing => true, :status => :forbidden
    else
      @users = User.all

SELECT "users".* FROM "users" WHERE ("users"."id" = 0) LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."type" = 'UserProfile') AND ("profiles".user_id = 1) LIMIT 1
---
  def show
    if !current_user.can_show("User") and User.find(params[:id]) != current_user
      render :nothing => true, :status => :forbidden
    else
      @user = User.find(params[:id])
      @userprofile = UserProfile.find(:first, :conditions => {:user_id => @user.id})

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    if !current_user.can_update("User") and User.find(params[:id]) != current_user